In [1]:
import pandas as pd
import numpy as np
import os

In [2]:
owd = os.getcwd()

In [25]:
os.chdir(owd)
os.chdir("Data/non_employment_data")
# Non-employment datasets
age = pd.read_csv("age.csv", dtype = "int64")
birth_country = pd.read_csv("birth_country.csv", dtype = "float64")
marrital_status = pd.read_csv("marrital_status.csv", dtype = "float64")
race = pd.read_csv("race.csv", dtype = "float64")
region = pd.read_csv("region.csv", dtype = "float64")
family_size = pd.read_csv("family_size.csv", dtype = "float64")
resident_type = pd.read_csv("resident_type.csv", dtype = "float64")

children = pd.read_csv("children.csv", dtype = "int64")
constant_var = pd.read_csv("constant variables.csv", dtype = "float64")

In [27]:
df_non = pd.merge(age, birth_country, on=['ID', 'year'] , how='outer')
for i in (marrital_status, race, region, family_size, children, resident_type):
    df_non = pd.merge(df_non, i, on=['ID', 'year'] , how='outer')
    
df_non = pd.merge(df_non, constant_var, on='ID' , how='outer')

In [28]:
df_non.head()

,ID,year,age,birth_country,marrital_status,race,region,family_size,n_children,resident_type,...,marijuana,internet,distrimination,Life_satis,Emergencyfund,life control,health insurance,risk,self_esteem,religion
0,1,1979,20,1.0,1.0,NaN,1.0,5.0,0.0,NaN,...,NaN,NaN,0.0,NaN,NaN,2.0,0.0,NaN,NaN,7.0
1,1,1980,21,1.0,NaN,NaN,NaN,NaN,-5.0,NaN,...,NaN,NaN,0.0,NaN,NaN,2.0,0.0,NaN,NaN,7.0
2,1,1981,22,1.0,1.0,NaN,1.0,5.0,0.0,NaN,...,NaN,NaN,0.0,NaN,NaN,2.0,0.0,NaN,NaN,7.0
3,1,1982,23,1.0,NaN,NaN,NaN,NaN,-5.0,NaN,...,NaN,NaN,0.0,NaN,NaN,2.0,0.0,NaN,NaN,7.0
4,1,1983,24,1.0,NaN,NaN,NaN,NaN,-5.0,NaN,...,NaN,NaN,0.0,NaN,NaN,2.0,0.0,NaN,NaN,7.0

In [29]:
df_non.info()

<class 'pandas.core.frame.DataFrame'>
Int64Index: 507440 entries, 0 to 507439
Data columns (total 29 columns):
 #   Column               Non-Null Count   Dtype
---  ------               --------------   -----
 0   ID                   507440 non-null  int64
 1   year                 507440 non-null  int64
 2   age                  507440 non-null  int64
 3   birth_country        507400 non-null  float64
 4   marrital_status      264459 non-null  float64
 5   race                 175000 non-null  float64
 6   region               261366 non-null  float64
 7   family_size          264496 non-null  float64
 8   n_children           228348 non-null  float64
 9   resident_type        227396 non-null  float64
 10  racial_cohort        507440 non-null  float64
 11  sample_id            507440 non-null  float64
 12  sex                  507440 non-null  float64
 13  mother_grade         475120 non-null  float64
 14  father_grade         435200 non-null  float64
 15  CESD Score           369480 non-null  float64
 16  drinking days        449560 non-null  float64
 17  injured              425920 non-null  float64
 18  employer healthplan  276240 non-null  float64
 19  marijuana            438080 non-null  float64
 20  internet             333080 non-null  float64
 21  distrimination       504400 non-null  float64
 22  Life_satis           302640 non-null  float64
 23  Emergencyfund        311840 non-null  float64
 24  life control         506440 non-null  float64
 25  health insurance     403640 non-null  float64
 26  risk                 368520 non-null  float64
 27  self_esteem          294760 non-null  float64
 28  religion             505320 non-null  float64
dtypes: float64(26), int64(3)
memory usage: 116.1 MB

In [30]:
df_non.shape

(507440, 29)

In [31]:
os.chdir(owd)
os.chdir("Data/employment_data")
# Employment datasets
industry_clean = pd.read_csv("industry_clean.csv", dtype = "int64")
Job_History = pd.read_csv("Job_History.csv", dtype = "int64")
job_type_clean = pd.read_csv("job_type_clean.csv", dtype = "int64")
why_left_clean = pd.read_csv("why_left_clean.csv", dtype = "int64")
cleaned_tenure = pd.read_csv("cleaned_tenure.csv", dtype = "int64")
hourly_payrate = pd.read_csv("hourly_payrate.csv", dtype = "int64")
hours_per_week = pd.read_csv("hours_per_week.csv", dtype = "int64")

Jobs_Data = pd.read_csv("Jobs_Data.csv", dtype = "int64")

In [32]:
hours_per_week

           ID  year  job_id  hours_per_week
0           1  1979       1              15
1           1  1979       2              38
2           1  1981       2              38
3           2  1979       1              35
4           2  1980       1              35
...       ...   ...     ...             ...
327346  12686  1989       1              40
327347  12686  1990       1              45
327348  12686  1991       1              45
327349  12686  1992       1              58
327350  12686  1993       1              50

[327351 rows x 4 columns]

In [33]:
df_em = pd.merge(industry_clean, Job_History, on=['ID', 'year', "job_id"] , how='outer')

for i in (job_type_clean, why_left_clean, cleaned_tenure, hourly_payrate, hours_per_week):
    df_em = pd.merge(df_em, i, on=['ID', 'year', "job_id"] , how='outer')

df_em = pd.merge(df_em, Jobs_Data, on=['ID', 'year'] , how='outer')

In [34]:
df_em.head()

,ID,year,job_id,industry,Start_Year,Stop_Year,job_type,why_left,weeks_tenure,hourly_payrate,hours_per_week,Switch_Job_1,Switch_Job_2,N_Jobs,Total_Jobs
0,1,1979,2,7.0,1978.0,1981.0,1.0,NaN,41.0,328.0,38.0,0.0,0.0,1.0,1.0
1,1,1979,1,NaN,NaN,NaN,NaN,3.0,21.0,NaN,15.0,0.0,0.0,1.0,1.0
2,1,1981,2,7.0,1978.0,1981.0,1.0,NaN,162.0,361.0,38.0,0.0,0.0,1.0,1.0
3,2,1979,1,5.0,1978.0,1993.0,1.0,NaN,42.0,385.0,35.0,0.0,0.0,1.0,4.0
4,2,1980,1,5.0,1978.0,1993.0,1.0,NaN,95.0,457.0,35.0,0.0,0.0,1.0,4.0

In [35]:
df_em.shape

(525511, 15)

In [36]:
df_em.info()

<class 'pandas.core.frame.DataFrame'>
Int64Index: 525511 entries, 0 to 525510
Data columns (total 15 columns):
 #   Column          Non-Null Count   Dtype
---  ------          --------------   -----
 0   ID              525511 non-null  int64
 1   year            525511 non-null  int64
 2   job_id          525511 non-null  int64
 3   industry        285126 non-null  float64
 4   Start_Year      420734 non-null  float64
 5   Stop_Year       420734 non-null  float64
 6   job_type        287746 non-null  float64
 7   why_left        131195 non-null  float64
 8   weeks_tenure    325491 non-null  float64
 9   hourly_payrate  288241 non-null  float64
 10  hours_per_week  328005 non-null  float64
 11  Switch_Job_1    500992 non-null  float64
 12  Switch_Job_2    500992 non-null  float64
 13  N_Jobs          500992 non-null  float64
 14  Total_Jobs      500992 non-null  float64
dtypes: float64(12), int64(3)
memory usage: 64.1 MB

In [37]:
df = pd.merge(df_non, df_em, on = ["ID", "year"], how='outer')

In [38]:
df

,ID,year,age,birth_country,marrital_status,race,region,family_size,n_children,resident_type,...,Stop_Year,job_type,why_left,weeks_tenure,hourly_payrate,hours_per_week,Switch_Job_1,Switch_Job_2,N_Jobs,Total_Jobs
0,1,1979,20,1.0,1.0,NaN,1.0,5.0,0.0,NaN,...,1981.0,1.0,NaN,41.0,328.0,38.0,0.0,0.0,1.0,1.0
1,1,1979,20,1.0,1.0,NaN,1.0,5.0,0.0,NaN,...,NaN,NaN,3.0,21.0,NaN,15.0,0.0,0.0,1.0,1.0
2,1,1980,21,1.0,NaN,NaN,NaN,NaN,-5.0,NaN,...,1981.0,NaN,NaN,NaN,NaN,NaN,0.0,0.0,1.0,1.0
3,1,1981,22,1.0,1.0,NaN,1.0,5.0,0.0,NaN,...,1981.0,1.0,NaN,162.0,361.0,38.0,0.0,0.0,1.0,1.0
4,1,1982,23,1.0,NaN,NaN,NaN,NaN,-5.0,NaN,...,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN
...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...
713220,12686,2014,53,1.0,NaN,9.0,NaN,NaN,NaN,NaN,...,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN
713221,12686,2015,54,1.0,NaN,9.0,NaN,NaN,NaN,NaN,...,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN
713222,12686,2016,55,1.0,NaN,9.0,NaN,NaN,NaN,NaN,...,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN
713223,12686,2017,56,1.0,NaN,9.0,NaN,NaN,NaN,NaN,...,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN
713224,12686,2018,57,1.0,NaN,9.0,NaN,NaN,NaN,NaN,...,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN

In [39]:
df.info()

<class 'pandas.core.frame.DataFrame'>
Int64Index: 713225 entries, 0 to 713224
Data columns (total 42 columns):
 #   Column               Non-Null Count   Dtype
---  ------               --------------   -----
 0   ID                   713225 non-null  int64
 1   year                 713225 non-null  int64
 2   age                  713225 non-null  int64
 3   birth_country        713179 non-null  float64
 4   marrital_status      445442 non-null  float64
 5   race                 251509 non-null  float64
 6   region               440959 non-null  float64
 7   family_size          445504 non-null  float64
 8   n_children           377847 non-null  float64
 9   resident_type        373743 non-null  float64
 10  racial_cohort        713225 non-null  float64
 11  sample_id            713225 non-null  float64
 12  sex                  713225 non-null  float64
 13  mother_grade         668594 non-null  float64
 14  father_grade         613383 non-null  float64
 15  CESD Score           548016 non-null  float64
 16  drinking days        641099 non-null  float64
 17  injured              623557 non-null  float64
 18  employer healthplan  421083 non-null  float64
 19  marijuana            636279 non-null  float64
 20  internet             500072 non-null  float64
 21  distrimination       709303 non-null  float64
 22  Life_satis           456349 non-null  float64
 23  Emergencyfund        469689 non-null  float64
 24  life control         712071 non-null  float64
 25  health insurance     591474 non-null  float64
 26  risk                 546945 non-null  float64
 27  self_esteem          443450 non-null  float64
 28  religion             710274 non-null  float64
 29  job_id               525511 non-null  float64
 30  industry             285126 non-null  float64
 31  Start_Year           420734 non-null  float64
 32  Stop_Year            420734 non-null  float64
 33  job_type             287746 non-null  float64
 34  why_left             131195 non-null  float64
 35  weeks_tenure         325491 non-null  float64
 36  hourly_payrate       288241 non-null  float64
 37  hours_per_week       328005 non-null  float64
 38  Switch_Job_1         500992 non-null  float64
 39  Switch_Job_2         500992 non-null  float64
 40  N_Jobs               500992 non-null  float64
 41  Total_Jobs           500992 non-null  float64
dtypes: float64(39), int64(3)
memory usage: 234.0 MB